Autodesk.Revit.DB.Structure.LoadBase.IsOrientToPermitted(Autodesk.Revit.DB.Structure.LoadOrientTo)
Indicates if the provided orientation is permitted for this load.
Remarks:
For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted.
For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted.
To determine if load is hosted use Autodesk.Revit.DB.Structure.LoadBase.IsHosted property.
orientTo:
Load orientation to check.
Returns:
True if provided orientation type is permitted for this load, false if not.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.LoadBase.IsReaction
The load is reaction option.
Since:
2016

Autodesk.Revit.DB.Structure.LoadBase.OrientTo
The load orientation option.
Remarks:
For hosted load only LoadOrientTo.Project and LoadOrientTo.HostLocalCoordinateSystem are permitted.
For non-hosted load only LoadOrientTo.Project and LoadOrientTo.WorkPlane are permitted.
To determine if load is hosted use Autodesk.Revit.DB.Structure.LoadBase.IsHosted property.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: orientTo is not permitted for this type of load.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2015

Autodesk.Revit.DB.Structure.LoadBase.WorkPlaneId
Id of the work plane which may determine the orientation of the load.
Remarks:
The load might be oriented to be perpendicular to this work plane. Determine how load is oriented by checking Autodesk.Revit.DB.Structure.LoadBase.OrientTo.
Since:
2015

Autodesk.Revit.DB.Structure.LoadBase.HostElement
The host element for the load.
Remarks:
If the load is hosted this is the AnalyticalModel element that hosts the load. If the load is not hosted, "null" is returned.

Autodesk.Revit.DB.Structure.LoadBase.HostElementId
The host element ID for the load.
Remarks:
If the load is hosted this is the id of the AnalyticalModel element that hosts the load. If the load is not hosted, ElementId.InvalidElementId is returned.
Since:
2015

Autodesk.Revit.DB.Structure.LoadBase.LoadCategoryName
The name of the category to which this load belongs.

Autodesk.Revit.DB.Structure.LoadBase.LoadNatureName
A string representing the nature of the load.

Autodesk.Revit.DB.Structure.LoadBase.LoadCaseName
The name of the load case to which this load belongs.

Autodesk.Revit.DB.Structure.LoadBase.LoadCase
The load case for the load.
Since:
2016

Autodesk.Revit.DB.Structure.LoadBase.LoadCaseId
The load case ID for the load.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2016

Autodesk.Revit.DB.Structure.LoadBase.IsHosted
Indicates if the Load is hosted or non-hosted.
Remarks:
True is returned when load is hosted. False is returned load is non-hosted.
To determine if load is hosted Autodesk.Revit.DB.Structure.LoadBase.HostElementId property or
Autodesk.Revit.DB.Structure.LoadBase.HostElement property may also be used.
Since:
2016

Autodesk.Revit.DB.Structure.LoadBase
The LoadBase object is the base class for all load objects within the Autodesk Revit API.
Remarks:
Load objects are only available in Autodesk Revit Structure. This object contains methods that are common to all other load objects.